title: Possible preparation for protobuf.dll DLL Hijacking
id: 5112682b-2169-48a3-8083-5b9ff8241524
status: experimental
description: Detects possible DLL hijacking of protobuf.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/irzyxa/protobuf.html
author: "Austin Worline"
date: 2026-04-14
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\protobuf.dll'

    condition: selection 
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

