title: Possible preparation for endpointdlp.dll DLL Hijacking
id: 9631882b-4228-48a3-4970-5b9ff8863388
status: experimental
description: Detects possible DLL hijacking of endpointdlp.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/endpointdlp.html
author: "Jose Oregon"
date: 2026-05-11
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\endpointdlp.dll'
    filter:
        TargetFileName:
            - 'c:\programdata\Microsoft\Windows Defender\Platform\\*\\*'
            - 'c:\program files\Windows Defender\\*\\*'
            - 'c:\program files (x86)\Windows Defender\\*\\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

