title: Possible preparation for libcares-2.dll DLL Hijacking
id: 3059582b-8917-48a3-7724-5b9ff8430517
status: experimental
description: Detects possible DLL hijacking of libcares-2.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/c-ares/libcares-2.html
author: "Wietze Beukema"
date: 2026-02-26
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\libcares-2.dll'
    filter:
        TargetFileName:
            - 'c:\users\\*\appdata\local\GitKraken\app-*\\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

