title: Possible preparation for jrtools.dll DLL Hijacking
id: 3986952b-1497-48a3-1258-5b9ff8247078
status: experimental
description: Detects possible DLL hijacking of jrtools.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/jriver/jrtools.html
author: "Rick Gatenby"
date: 2026-02-03
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\jrtools.dll'
    filter:
        TargetFileName:
            - 'c:\program files\J River\Media Center *\\*'
            - 'c:\program files (x86)\J River\Media Center *\\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

