title: Possible preparation for browser_host.dll DLL Hijacking
id: 4792392b-8154-48a3-4104-5b9ff8919147
status: experimental
description: Detects possible DLL hijacking of browser_host.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/3rd_party/sohu/browser_host.html
author: "Wietze Beukema"
date: 2026-06-14
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\browser_host.dll'
    filter:
        TargetFileName:
            - 'c:\program files\SogouInput\\*'
            - 'c:\program files (x86)\SogouInput\\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

