title: Possible preparation for bthprops.cpl DLL Hijacking
id: 9160872b-3316-48a3-9077-5b9ff8347867
status: experimental
description: Detects possible DLL hijacking of bthprops.cpl by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/bthprops.html
author: "Swachchhanda Shrawan Poudel"
date: 2026-02-05
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\bthprops.cpl'
    filter:
        TargetFileName:
            - 'c:\windows\system32\\*'
            - 'c:\windows\syswow64\\*'
            - 'c:\windows\Prefetch\\*'
            - 'c:\windows\winsxs\*'
            - 'c:\$windows.~bt\*'
            - 'c:\windows\softwaredistribution\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

