title: Possible preparation for systemsettings.dll DLL Hijacking
id: 1360602b-8250-48a3-4063-5b9ff8296247
status: experimental
description: Detects possible DLL hijacking of systemsettings.dll by looking for suspicious file writes of this DLL, to unexpected locations.
references:
    - https://hijacklibs.net/entries/microsoft/built-in/systemsettings.html
author: "Daniel Koifman"
date: 2026-06-24
tags:
    - attack.defense_evasion
    - attack.T1574.001
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFileName: '*\systemsettings.dll'
    filter:
        TargetFileName:
            - 'C:\Windows\ImmersiveControlPanel\\*'
            - 'C:\Windows\WinSxS\\*'

    condition: selection and not filter
falsepositives:
    - False positives are likely. This rule is more suitable for hunting than for generating detections.

